<!-- +----------------------------------------------------------------------
  | XYGo Admin [ Vue3 + GoFrame 企业级中后台管理系统 ]
  +----------------------------------------------------------------------
  | Copyright (c) 2026 大连星韵网络科技有限公司 All rights reserved.
  +----------------------------------------------------------------------
  | Licensed ( https://opensource.org/licenses/MIT )
  +----------------------------------------------------------------------
  | Author: 喜羊羊 <751300685@qq.com>
  +---------------------------------------------------------------------- -->
<template>
  <ArtLineChartCard
    class="mb-5 max-sm:mb-4"
    :value="2545"
    label="购物车转化率"
    :percentage="1.2"
    :height="13.5"
    :chartData="[120, 132, 101, 134, 90, 230, 210]"
    :showAreaColor="true"
  />
</template>
